dot/genomon_rna.dot
digraph "Genomon Pipeline Schemes RNA"
{
	size = "11";
	splines = true;
	fontsize = "30";
	ranksep = 0.3;
	node[fontname = "helvetica", fontsize="12"];
	graph[clusterrank = "local"];
	
	subgraph clustertasks
	{
		rank="min";
		fontname = "helvetica"
		fontcolor = "#FF3232";
		label = "Genomon Pipeline Schemes RNA";

		#### task
		# input
		tsk_input_bam2fastq     [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[bam_tofastq]"];
		tsk_input_fastq         [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[fastq]"];
		tsk_input_bamimport     [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[bam_import]"];

		# stage
		tsk_bam2fastq           [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="bam2fastq"];
		tsk_link_import_bam     [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="link_import_bam"];
		tsk_link_input_fastq    [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="link_input_fastq"];
		tsk_star                [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_star_align"];

		# output
		out_star                [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="Aligned.sortedByCoord.out.bam"];
		out_starqc              [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="Log.final.out"];

		#### link
		# input
		tsk_input_bam2fastq -> tsk_bam2fastq[color="#0044A0"];
		tsk_input_fastq -> tsk_link_input_fastq[color="#0044A0"];
		tsk_input_bamimport -> tsk_link_import_bam[color="#0044A0"];

		# stage
		tsk_bam2fastq -> tsk_star[color="#0044A0"];
		tsk_link_input_fastq -> tsk_star[color="#0044A0"];

		tsk_star -> out_star[color="#0044A0"];
		tsk_star -> out_starqc[color="#0044A0"];
		tsk_link_import_bam -> out_star[color="#0044A0"];
		tsk_link_import_bam -> out_starqc[color="#0044A0"];

		out_star -> tsk_f_count[color="#0044A0"];
		out_star -> tsk_e_expression[color="#0044A0"];
		out_starqc -> tsk_q_pa[color="#0044A0"];

		out_star -> tsk_i_retention[color="#0044A0", style="dotted"];
		
		subgraph clustertasks_fusion
		{
			#rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = " [fusion]";
			style = dashed;

			#### task
			tsk_f_count         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_fusion_count"];
			tsk_f_merge         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_fusion_merge"];
			tsk_f_fusion        [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_fusionfusion"];
			tsk_f_pa            [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_fusionfusion"];
			tsk_f_paplot        [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];
			
			# output
			out_f_result        [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="fusion_fusion.result.txt"];
			out_f_pa            [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			out_f_paplot        [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];

			#### link
			# stage
			tsk_f_count -> tsk_f_merge[color="#0044A0"];
			tsk_f_merge -> tsk_f_fusion[color="#0044A0"];
			
			# output
			tsk_f_fusion -> out_f_result[color="#0044A0"];

			# post_analysis
			out_f_result -> tsk_f_pa[color="#0044A0"];
			tsk_f_pa -> out_f_pa[color="#0044A0"];

			# paplot
			out_f_pa -> tsk_f_paplot[color="#0044A0"];
			tsk_f_paplot -> out_f_paplot[color="#0044A0"];
		}
		subgraph clustertasks_expression
		{
			#rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = " [expression]";
			style = dashed;
        
			#### task
			tsk_e_expression    [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_genomon_expression"];
			#tsk_e_pa           [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_expression"];
			#tsk_e_paplot       [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];
			
			# output
			out_e_result        [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="sym2fkpm.txt"];
			#out_e_pa           [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			#out_e_paplot       [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];
			
        
			#### lines
			# stage
			tsk_e_expression -> out_e_result[color="#0044A0"];
			
			# post_analysis
			#out_e_result -> tsk_e_pa[color="#0044A0"];
			#tsk_e_pa -> out_e_pa[color="#0044A0"];
        
			# paplot
			#out_e_pa -> tsk_e_paplot[color="#0044A0"];
			#tsk_e_paplot -> out_e_paplot[color="#0044A0"];
		}
		subgraph clustertasks_intron
		{
			#rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = " [intron_retention]";
			style = dashed;
        
			#### task
			tsk_i_retention     [color="#333333", fillcolor="#DDDDDD", fontcolor="#333333", shape=box3d, style=filled, label="task_intron_retention"];
			#tsk_i_retention    [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="task_intron_retention"];
			#tsk_i_pa           [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_ir"];
			#tsk_i_paplot       [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];
			
			# output
			out_i_result        [color="#333333", fillcolor="#DDDDDD", fontcolor="#333333", shape=box3d, style=filled, label="ir_simple_count.txt"];
			#out_i_result       [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="ir_simple_count.txt"];
			#out_i_pa           [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			#out_i_paplot       [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];
			
        
			#### link
			# stage
			tsk_i_retention -> out_i_result[color="#0044A0", style="dotted"];
			
			# post_analysis
			#out_i_result -> tsk_i_pa[color="#0044A0"];
			#tsk_i_pa -> out_i_pa[color="#0044A0"];
        
			# paplot
			#out_i_pa -> tsk_i_paplot[color="#0044A0"];
			#tsk_i_paplot -> out_i_paplot[color="#0044A0"];
		}
		subgraph clustertasks_starqc
		{
			#rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = " [qc]";
			style = dashed;

			#### task
			tsk_q_pa            [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_star_qc"];
			tsk_q_paplot        [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];
			
			# output
			out_q_pa            [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			out_q_paplot        [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];
			

			#### link
			# post_analysis
			tsk_q_pa -> out_q_pa[color="#0044A0"];

			# paplot
			out_q_pa -> tsk_q_paplot[color="#0044A0"];
			tsk_q_paplot -> out_q_paplot[color="#0044A0"];
		}
	}
	
	subgraph clusterkey1
	{
		rank = "min";
		style  = filled;
		
		fontname = "helvetica"
		fontsize = 16;
		color = "#F6F4F4";
		label = "Key:"

		node[margin="0.2,0.2", fontname = "helvetica", fontsize="10"];
		k1[color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", label="Input", shape=box3d, style=filled];
		k2[color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", label="Task to run", shape=box3d, style=filled];
		k3[color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", label="Output", shape=box3d, style=filled];
		k4[color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", label="Task to run", shape=box3d, style=filled];
		k5[color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", label="Post Analysis Output", shape=box3d, style=filled];
		k1 -> k2[color="#0044A0", arrowtype=normal];
		k2 -> k3[color="#0044A0", arrowtype=normal];
		k3 -> k4[color="#0044A0", arrowtype=normal];
		k4 -> k5[color="#0044A0", arrowtype=normal];
		
		under_develop[color="#333333", fillcolor="#DDDDDD", fontcolor="#333333", label="Under Development", shape=box3d, style=filled];
		k5 -> under_develop[style=invis];
	}
}
